TrampolineRTOS/trampoline/machines/cortex-m/armv7em/efm32wg/emlib/inc/em_adc.h
#if defined(_ADC_CTRL_ADCCLKMODE_MASK)
/** ADC EM2 clock configuration */
typedef enum {
  adcEm2Disabled           = 0,
  adcEm2ClockOnDemand      = ADC_CTRL_ADCCLKMODE_ASYNC | ADC_CTRL_ASYNCCLKEN_ASNEEDED,
  adcEm2ClockAlwaysOn      = ADC_CTRL_ADCCLKMODE_ASYNC | ADC_CTRL_ASYNCCLKEN_ALWAYSON,
} ADC_EM2ClockConfig_TypeDef;
#endif

/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** ADC init structure, common for single conversion and scan sequence. */
typedef struct {
  /**
   * Oversampling rate select. In order to have any effect, oversampling must
   * be enabled for single/scan mode.
   */
  ADC_OvsRateSel_TypeDef        ovsRateSel;

#if defined(_ADC_CTRL_LPFMODE_MASK)
  /** Lowpass or decoupling capacitor filter to use. */
  ADC_LPFilter_TypeDef          lpfMode;
#endif

  /** Warm-up mode to use for ADC. */
  ADC_Warmup_TypeDef            warmUpMode;

  /**
   * Timebase used for ADC warm up. Select N to give (N+1)HFPERCLK cycles.
   * (Additional delay is added for bandgap references, please refer to the
   * reference manual.) Normally, N should be selected so that the timebase
   * is at least 1 us. See ADC_TimebaseCalc() for a way to obtain
   * a suggested timebase of at least 1 us.
   */
  uint8_t                       timebase;

  /** Clock division factor N, ADC clock =  HFPERCLK / (N + 1). */
  uint8_t                       prescale;

  /** Enable/disable conversion tailgating. */
  bool                          tailgate;

  /** ADC EM2 clock configuration */
#if defined(_ADC_CTRL_ADCCLKMODE_MASK)
  ADC_EM2ClockConfig_TypeDef    em2ClockConfig;
#endif
} ADC_Init_TypeDef;

/** Default config for ADC init structure. */
#if defined(_ADC_CTRL_LPFMODE_MASK) && (!defined(_ADC_CTRL_ADCCLKMODE_MASK))
#define ADC_INIT_DEFAULT                                                   \
  {                                                                        \
    adcOvsRateSel2,              /* 2x oversampling (if enabled). */       \
    adcLPFilterBypass,           /* No input filter selected. */           \
    adcWarmupNormal,             /* ADC shutdown after each conversion. */ \
    _ADC_CTRL_TIMEBASE_DEFAULT,  /* Use HW default value. */               \
    _ADC_CTRL_PRESC_DEFAULT,     /* Use HW default value. */               \
    false                        /* Do not use tailgate. */                \
  }
#elif (!defined(_ADC_CTRL_LPFMODE_MASK)) && (!defined(_ADC_CTRL_ADCCLKMODE_MASK))
#define ADC_INIT_DEFAULT                                                   \
  {                                                                        \
    adcOvsRateSel2,              /* 2x oversampling (if enabled). */       \
    adcWarmupNormal,             /* ADC shutdown after each conversion. */ \
    _ADC_CTRL_TIMEBASE_DEFAULT,  /* Use HW default value. */               \
    _ADC_CTRL_PRESC_DEFAULT,     /* Use HW default value. */               \
    false                        /* Do not use tailgate. */                \
  }
#elif (!defined(_ADC_CTRL_LPFMODE_MASK)) && defined(_ADC_CTRL_ADCCLKMODE_MASK)
#define ADC_INIT_DEFAULT                                                   \
  {                                                                        \
    adcOvsRateSel2,              /* 2x oversampling (if enabled). */       \
    adcWarmupNormal,             /* ADC shutdown after each conversion. */ \
    _ADC_CTRL_TIMEBASE_DEFAULT,  /* Use HW default value. */               \
    _ADC_CTRL_PRESC_DEFAULT,     /* Use HW default value. */               \
    false,                       /* Do not use tailgate. */                \
    adcEm2Disabled               /* ADC disabled in EM2 */                 \
  }
#endif

/** Scan input configuration */
typedef struct {
  /** Input range select to be applied to ADC_SCANINPUTSEL. */
  uint32_t            scanInputSel;

  /** Input enable mask */
  uint32_t            scanInputEn;

  /** Alternative negative input */
  uint32_t            scanNegSel;
} ADC_InitScanInput_TypeDef;

/** Scan sequence init structure. */
typedef struct {
  /**
   * Peripheral reflex system trigger selection. Only applicable if @p prsEnable
   * is enabled.
   */
  ADC_PRSSEL_TypeDef  prsSel;

  /** Acquisition time (in ADC clock cycles). */
  ADC_AcqTime_TypeDef acqTime;

  /**
   * Sample reference selection. Notice that for external references, the
   * ADC calibration register must be set explicitly.
   */
  ADC_Ref_TypeDef     reference;

  /** Sample resolution. */
  ADC_Res_TypeDef     resolution;

#if defined(_ADC_SCANCTRL_INPUTMASK_MASK)
  /**
   * Scan input selection. If single ended (@p diff is false), use logical
   * combination of ADC_SCANCTRL_INPUTMASK_CHx defines. If differential input
   * (@p diff is true), use logical combination of ADC_SCANCTRL_INPUTMASK_CHxCHy
   * defines. (Notice underscore prefix for defines used.)
   */
  uint32_t            input;
#endif

#if defined(_ADC_SCANINPUTSEL_MASK)
  /**
   * Scan input configuration. @ref Use ADC_ScanInputClear(), @ref ADC_ScanSingleEndedInputAdd()
   * or @ref ADC_ScanDifferentialInputAdd() to update this struct.
   */
  ADC_InitScanInput_TypeDef scanInputConfig;
#endif

  /** Select if single ended or differential input. */
  bool                diff;

  /** Peripheral reflex system trigger enable. */
  bool                prsEnable;

  /** Select if left adjustment should be done. */
  bool                leftAdjust;

  /** Select if continuous conversion until explicit stop. */
  bool                rep;

  /** When true, DMA is available in EM2 for scan conversion */
#if defined(_ADC_CTRL_SCANDMAWU_MASK)
  bool                scanDmaEm2Wu;
#endif

#if defined(_ADC_SCANCTRLX_FIFOOFACT_MASK)
  /** When true, the FIFO overwrites old data when full. If false, then the FIFO discards new data.
      The SINGLEOF IRQ is triggered in both cases. */
  bool                fifoOverwrite;
#endif
} ADC_InitScan_TypeDef;

/** Default config for ADC scan init structure. */
#if defined(_ADC_SCANCTRL_INPUTMASK_MASK)
#define ADC_INITSCAN_DEFAULT                                                      \
  {                                                                               \
    adcPRSSELCh0,            /* PRS ch0 (if enabled). */                          \
    adcAcqTime1,             /* 1 ADC_CLK cycle acquisition time. */              \
    adcRef1V25,              /* 1.25V internal reference. */                      \
    adcRes12Bit,             /* 12 bit resolution. */                             \
    0,                       /* No input selected. */                             \
    false,                   /* Single-ended input. */                            \
    false,                   /* PRS disabled. */                                  \
    false,                   /* Right adjust. */                                  \
    false,                   /* Deactivate conversion after one scan sequence. */ \
  }
#endif

#if defined(_ADC_SCANINPUTSEL_MASK)
#define ADC_INITSCAN_DEFAULT                                                         \
  {                                                                                  \
    adcPRSSELCh0,            /* PRS ch0 (if enabled). */                             \
    adcAcqTime1,             /* 1 ADC_CLK cycle acquisition time. */                 \
    adcRef1V25,              /* 1.25V internal reference. */                         \
    adcRes12Bit,             /* 12 bit resolution. */                                \
    {                                                                                \
      /* Initialization should match values set by @ref ADC_ScanInputClear() */      \
      ADC_SCANINPUTSEL_NONE, /* Default ADC inputs */                                \
      0,                     /* Default input mask (all off) */                      \
      _ADC_SCANNEGSEL_RESETVALUE,/* Default negative select for positive ternimal */ \
    },                                                                               \
    false,                   /* Single-ended input. */                               \
    false,                   /* PRS disabled. */                                     \
    false,                   /* Right adjust. */                                     \
    false,                   /* Deactivate conversion after one scan sequence. */    \
    false,                   /* No EM2 DMA wakeup from scan FIFO DVL */              \
    false                    /* Discard new data on full FIFO. */                    \
  }
#endif

/** Single conversion init structure. */
typedef struct {
  /**
   * Peripheral reflex system trigger selection. Only applicable if @p prsEnable
   * is enabled.
   */
  ADC_PRSSEL_TypeDef            prsSel;

  /** Acquisition time (in ADC clock cycles). */
  ADC_AcqTime_TypeDef           acqTime;

  /**
   * Sample reference selection. Notice that for external references, the
   * ADC calibration register must be set explicitly.
   */
  ADC_Ref_TypeDef               reference;

  /** Sample resolution. */
  ADC_Res_TypeDef               resolution;

